# global = משמעות של היא : להצהיר על משתנה מסוים גלובלי ולא מקומי הכוונה  המשתנה קיים מחוץ לפונקציה ברמה גלובלית של התוכנית והפונקציה  מתייחסת ומשנה את המשתנה הזה ולא יוצרת משתנה חדש מקומי עם אותו השם
# שימוש בGLOBAL- יוצר בעיות כמו קושי במעקב וקריאת פונקציה וקושי בתיקון באגים


#מדוע כאן נקבל שגיאה-

#x: int = 1
#def foo():
#print(x)
#x = 4
#foo()
#  אנו נקבל שגיאה בקוד גלל שהמשתנה x מתייחס גם כמשתנה גלובלי וגם כמשתנה מקומי באותה פונקציה, והפונקציה מנסה להדפיס אותו לפני שהוא הוגדר



